print("---------------------------------------欢迎来到于锌的水果商城--------------------------------------------------")
print("================================= ==========================================================================")
print("水果名称                      水果价格                              水果品质                             水果数量")
print("苹果                          0.3                                   A                                 500 ")
print("橙子                          0.5                                   B                                 300")
print("香蕉                          1.0                                   A                                 200")
print("橘子                          0.2                                   S                                 600  ")
print("葡萄                          0.4                                   A                                 100")
print("柚子                          2.0                                   A                                 60")
print("芒果                          1.0                                   s                                 800")
print("木瓜                          3.0                                   A                                 50")
print("蓝莓                          4.0                                   A                                 90")
print("西瓜                          2.0                                   A                                 40")
print("樱桃                          5.0                                   s                                 500")
print("黄桃                          3.0                                   A                                 80")
print("石榴                          9.0                                   B                                 100")
print("车厘子                        12.0                                  S                                  80")
print("火龙果                        16.0                                  A                                  60")
print("============================================================================================================")
print("总金额为:",0.3*500+0.5*300+1.0*200+0.2*600+0.4*100+2.0*60+1.0*800+3.0*50+4.0*90+2.0*40+5.0*500+3.0*80+9.0*100+12.0*80+16.0*60,"RMB")


username="苹果"
prices="0.3"
quality="A"
number="500"

u1="火龙果"
p1="0.4"
u4="3.4"
y5="o.6"



info='''
水果名称:             水果价格:                水果品质:                  水果数量:
{username}                    {prices}                {quality}                       {number}    
'''
u1="火龙果"
p1="0.4"
u4="A"
y5="90"

y2="橙子"
t3="9"
u3="b"
o5="80"

print("---------------------------------------欢迎来到于锌的水果商城--------------------------------------------------")
print(info.format(username=username,prices=prices,quality=quality,number=number))
print(info.format(username=u1,prices=p1,quality=u4,number=y5))
print(info.format(username=y2,prices=t3,quality=u3,number=o5))
