names=[
["何登勇","56","男","106","IBM", 500 ,"50"],
["曹东雪","19","女","230","微软", 501 ,"60"],
["刘营营", "19", "女", "210", "Oracle", 600, "60"],
["李汉聪", "45", "男", "230", "Tencent", 700 , "10"],
]
sum=0
for i in range(0,len(names)):
    sum=sum+names[i][5]
print("每人平均薪资为：", sum / 4)


names=[
["何登勇","56","男","106","IBM", 500 ,"50"],
["曹东雪","19","女","230","微软", 501 ,"60"],
["刘营营", "19", "女", "210", "Oracle", 600, "60"],
["李汉聪", "45", "男", "230", "Tencent", 700 , "10"],
["张佳伟","45","男","220","alibaba",500,30],
]

age=0
for i in range(0,len(names)):
    age = age + int(names[i][1])
print("每个人的平均年龄为：", age / 4)

names=[
["何登勇","56","男","106","IBM", 500 ,"50"],
["曹东雪","19","女","230","微软", 501 ,"60"],
["刘营营", "19", "女", "210", "Oracle", 600, "60"],
["李汉聪", "45", "男", "230", "Tencent", 700 , "10"],
["张佳伟","45","男","220","alibaba",500,30],
]

man=0
woman=0
for i in range(0,len(names)):
        if names[i][2]=="男" :
         man=man+1
else:
    woman=woman+1
print("男生的人数为：",man,"人","\t","女生的人数为：",woman,"人")


names=[
["何登勇","56","男","106","IBM", 500 ,"50"],
["曹东雪","19","女","230","微软", 501 ,"60"],
["刘营营", "19", "女", "210", "Oracle", 600, "60"],
["李汉聪", "45", "男", "230", "Tencent", 700 , "10"],
["张佳伟","45","男","220","alibaba",500,"30"],
]

he=0
cao=0
liu=0
li=0
for i in  range(0,len(names)):
    if names[i][6]=="50":
        he=he+1
    elif names[i][6]=="50":
        cao=cao+1
    elif names[i][6]=="10":
        liu=liu+1
    else:
        li=li+1
print("部门编号为50的有",he,"人")
print("部门编号为60的有",cao,"人")
print("部门编号为10的有",liu,"人")
print("部门编号为30的有",li,"人")




